# GetContextualHelp Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonItemData..::..GetContextualHelp Method
RibbonItemData Class See Also
---
Gets the contextual help bound with this control.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ContextualHelp GetContextualHelp()
```

Visual Basic
---
```text
Public Function GetContextualHelp As ContextualHelp
```

Visual C++
---
```text
public:
ContextualHelp^ GetContextualHelp()
```

# ### Return Value
The contextual help assigned to the item, or nullNothingnullptra null reference (Nothing in Visual Basic) if there is no binding assigned.
# See Also
RibbonItemData Class
Autodesk.Revit.UI Namespace